app/views/lists/index.html.erb

<div class="content">
  <!-- <h2><%= (Task.where(complete: [false, nil]).sum(:time_estimate)/60).round(2) %><%= " hours of tasks" %></h2> -->
---
SELECT SUM("tasks"."time_estimate") FROM "tasks" WHERE "tasks"."list_id" = $1 AND ("tasks"."complete" = 'f' OR "tasks"."complete" IS NULL)  [["list_id", 18]]

        <% if list.list_type == "Shopping List" %>
        <%= number_to_currency(Task.where(list_id: list.id).sum(:cost)) %></li>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = $1  [["list_id", 2]]
SELECT SUM("tasks"."cost") FROM "tasks" WHERE "tasks"."list_id" = $1  [["list_id", 2]]