app/views/lists/show.html.erb


<h3><%= Task.where(list_id: @list.id).sum(:time_estimate) %><%= " hours" %></h3>
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."list_id" = $1  ORDER BY "tasks"."id" ASC LIMIT 1  [["list_id", 15]]
SELECT SUM("tasks"."time_estimate") FROM "tasks" WHERE "tasks"."list_id" = $1  [["list_id", 15]]

<ul>
  <%  @list.tasks.each do |task| %>
---
SELECT "tasks".* FROM "tasks"