app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."user_id" IS NULL
---
  def index
    @lists = List.where(user_id: current_user)

INSERT INTO "lists" ("name", "list_type", "category", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Grocery List"], ["list_type", "Shopping List"], ["category", ""], ["user_id", 1], ["created_at", "2016-03-24 00:11:57.965416"], ["updated_at", "2016-03-24 00:11:57.965416"]]
---
  def create
    @list = List.create!(list_params.merge(user: current_user))

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "lists" SET "category" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["category", "Home 2"], ["updated_at", "2016-03-20 16:04:13.169554"], ["id", 1]]
---
  def update
    @list = List.find(params[:id]).update(list_params)

DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 10]]
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 10]]
---
  def destroy
    @list = List.find(params[:id]).destroy

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 15]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 44]]
UPDATE "tasks" SET "complete" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["complete", "t"], ["updated_at", "2016-03-22 23:14:25.093323"], ["id", 44]]
---
  def completed_task
    @list = List.find(params[:id])
    @task = Task.find(params[:task_id])

      @task.update(complete: true)