app/controllers/lists_controller.rb

  def index
    @list = List.all
---
SELECT "lists".* FROM "lists"