app/controllers/tasks_controller.rb

  def index
    @tasks = Task.where(complete: [nil, false])
---
SELECT "tasks".* FROM "tasks" WHERE ("tasks"."complete" = 'f' OR "tasks"."complete" IS NULL)

  def new
    # JGZ - Could be cleaned up so you don't have to repeat this over and over
    # before_action :set_list, only: [:new,:edit,:create,:update,:destroy]
    # and then in your private area:
    # def set_list
    #   @list = List.find(params[:id])
    # end
    @list = List.find(params[:list_id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", nil]]

  def create
    @list = List.find(params[:list_id])
    @task = @list.tasks.create!(task_param)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "tasks" ("name", "category", "priority", "description", "image", "list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["name", "test"], ["category", ""], ["priority", ""], ["description", ""], ["image", ""], ["list_id", 1], ["created_at", "2016-03-19 17:37:10.798704"], ["updated_at", "2016-03-19 17:37:10.798704"]]

  def edit
    @list = List.find(params[:list_id])
    @task = Task.find(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 11]]

  def update
    @list = List.find(params[:list_id])
    @task = Task.find(params[:id]).update(task_param)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 12]]
UPDATE "tasks" SET "name" = $1, "time_estimate" = $2, "complete" = $3, "updated_at" = $4 WHERE "tasks"."id" = $5  [["name", "fix list level time, add user dimension"], ["time_estimate", 0], ["complete", "f"], ["updated_at", "2016-03-24 00:27:14.357845"], ["id", 80]]

  def destroy
    @list = List.find(params[:list_id])
    @task = Task.find(params[:id]).destroy
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 19]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 19]]