app/controllers/tasks_controller.rb

  def index
    @task = Task.all
---
SELECT "tasks".* FROM "tasks"